Revit 2027 API
TableSectionData.GetCellCombinedParameters(Int32, Int32) Method
 Returns an array of combined parameter data for the specified cell
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<TableCellCombinedParameterData> GetCellCombinedParameters(
	int nRow,
	int nCol
)
Public Function GetCellCombinedParameters (
	nRow As Integer,
	nCol As Integer
) As IList(Of TableCellCombinedParameterData)
public:
IList<TableCellCombinedParameterData^>^ GetCellCombinedParameters(
	int nRow,
	int nCol
)
member GetCellCombinedParameters :
        nRow : int *
        nCol : int -> IList<TableCellCombinedParameterData>
Parameters
nRow Int32
nCol Int32
Return Value
IList<TableCellCombinedParameterData>
Exceptions
Exception | Condition
ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
See Also
Reference
TableSectionData Class
GetCellCombinedParameters Overload
Autodesk.Revit.DB Namespace